Revit 2027 API
ConnectorElement.Radius Property
The radius of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual double Radius { get; }
Public Overridable ReadOnly Property Radius As Double
	Get
public:
virtual property double Radius {
	double get ();
}
abstract Radius : float with get
override Radius : float with get
Property Value
Double
Implements
IConnector.Radius
Remarks
-1 if the connector is not round.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace